public_html/hw7.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>hw7</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="hw7"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-23 22:24:24 CDT"/>
<meta name="author" content="Neil Best"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">hw7</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 CSPP 53001: Assignment 7</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-1">1.1 Online homework and project due by 11:59pm on Tuesday, December 4,</a></li>
<li><a href="#sec-1-2">1.2 Step 7 of Your TBP App</a></li>
<li><a href="#sec-1-3">1.3 Problem Set</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CSPP 53001: Assignment 7</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> Online homework and project due by 11:59pm on Tuesday, December 4,</h4>
<div class="outline-text-4" id="text-1-1">

<p>2012
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2"><span class="section-number-4">1.2</span> Step 7 of Your TBP App</h4>
<div class="outline-text-4" id="text-1-2">


<p>
The seventh part of your TBP project is to create a web interface to
your database using the php programming language and a web server.
</p>
<p>
First, you will need to request an
<a href="https://tools.cs.uchicago.edu/activate_cgi_service">account</a> on the
CS CGI server. Then you should create a directory named <code>cs53001</code> in
your <code>/stage/cgi-cspp/&lt;your_username&gt;/public_html</code> directory.
</p>
<p>
Next, you will create a web page that will be the (temporary) interface
to your TBP. This web page should consist of links and forms and short
explanations for any complex functions that implement the functionality
needed by your TBP app. The functions and their parameters will depend
on your schema and application scenario but you should certainly include
functions that display users and tweets based on some conditions.
</p>
<p>
Every link and form on this web page should correspond to (and
implement) a particular functionality of your TBP app. For this
assignment, you will only need to implement 8-10 functions. You don't
have to implement any functions that modify your database such as
registering a new user or sending a tweet - you will get to do that in
the last part of your TBP app.
</p>
<p>
Here is an example of a web page, <a href="#tbp.html.txt"><code>tbp.html</code></a>, that has
a link to a php script <a href="#list_tables.php.txt"><code>list<sub>tables</sub>.php</code></a> and a
form that runs <a href="#list_attrs.php.txt"><code>list<sub>attrs</sub>.php</code></a>. Note that the
names of the files have an extra <code>.txt</code> extension so the source code can
be viewed in your browser. The second php file assumes that you have a
table Users with several attributes.
</p>
<p>
For a quick primer on HTML forms you can go to
<a href="http://www.w3schools.com/html/html_forms.asp">http://www.w3schools.com/html/html_forms.asp</a>.
</p>
<p>
For more information on how to handle form variables passed to php refer
to this section of the php manual
<a href="http://us3.php.net/manual/en/language.variables.external.php">http://us3.php.net/manual/en/language.variables.external.php</a>.
</p>
<p>
For more information on accessing MySQL from php read
<a href="http://us3.php.net/manual/en/ref.mysql.php">http://us3.php.net/manual/en/ref.mysql.php</a>.
</p>
<p>
Your web page that contains all links and forms should be named`
<code>tbp.html</code> and should be placed in your
<code>/stage/cgi-cspp/&lt;your_username&gt;/public_html/cs53001/</code> directory. Make
sure that this page is viewable by a browser. The url is:
<code>http://cgi-cspp.cs.uchicago.edu/~&lt;your_username&gt;/cs53001/tbp.html</code>.
</p>
<p>
You will submit your homework by emailing the TAs and instructor a link
to your TBP web page.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-4">
<h4 id="sec-1-3"><span class="section-number-4">1.3</span> Problem Set</h4>
<div class="outline-text-4" id="text-1-3">


<p>
You will complete two SQL labs using
<a href="http://www.newgradiance.com/">Gradiance</a>
(<a href="http://www.newgradiance.com/">http://www.newgradiance.com/</a>). The names of the SQL Labs are
CSPPDB-Aut12 HW7a and CSPPDB-Aut12 HW7b
</p>
<p>
<b>The due date for the SQL labs is midnight on Tuesday, December 4, 2012.</b>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-23 22:24:24 CDT</p>
<p class="author">Author: Neil Best</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
